# 当前是第1次执行循环
# i = 0

# 当前是第2次执行循环
# i = 1

# 当前是第3次执行循环
# i = 2

# 当前是第4次执行循环
# i = 3

# 当前是第5次执行循环
# i = 4

# 定义变量
# i = 0
#
# print("当前是第%d次执行循环" % (i + 1))
# print("i = %d" % i)
# i += 1
#
# print("当前是第%d次执行循环" % (i + 1))
# print("i = %d" % i)
# i += 1
#
# print("当前是第%d次执行循环" % (i + 1))
# print("i = %d" % i)
# i += 1
#
# print("当前是第%d次执行循环" % (i + 1))
# print("i = %d" % i)
# i += 1
#
# print("当前是第%d次执行循环" % (i + 1))
# print("i = %d" % i)
# i += 1

# 定义变量
# i = 0
# while i < 5:
#     print("当前是第%d次执行循环" % (i + 1))
#     print("i = %d" % i)
#     i += 1
# print("测试")

# 特殊的循环 -> 死循环
# i = 0
# while True:
#     print("当前是第%d次执行循环" % (i + 1))
#     print("i = %d" % i)


