# if判断语句完成
"""
格式:
if 判断条件:
    如果判断条件成立(真True) 做的事情1
    如果判断条件成立(真True) 做的事情2
    如果判断条件成立(真True) 做的事情...
"""

# 是否有危险品
# 定义一个变量 记录是否有危险品 假设 True -> 危险品
# flag = True
# if flag == True:
#     print("您有危险品, 请出去...")
#     print("您有危险品, 请出去...")
#     print("您有危险品, 请出去...")
#     print("您有危险品, 请出去...")
# print("测试")

# 进入网吧
# age = int(input("请输入您的年龄:"))
# if age >= 18:
#     print("请上网...")

# 打开保险柜
# 密码:12345
passwd = input("请输入您的密码:")
# s = passwd == "12345"
# print(s)
if passwd == "12345":
    print("密码正确...")