# == 	检查两个操作数的值是否相等，如果是则条件变为真。 	如a=3,b=3，则(a <= b) 为 True== 	检查两个操作数的值是否相等，如果是则条件变为真。 	如a=3,b=3，则（a == b) 为 True
# != 	检查两个操作数的值是否相等，如果值不相等，则条件变为真。 	如a=1,b=3，则(a != b) 为 True
# > 	检查左操作数的值是否大于右操作数的值，如果是，则条件成立。 	如a=7,b=3，则(a > b) 为 True
# < 	检查左操作数的值是否小于右操作数的值，如果是，则条件成立。 	如a=7,b=3，则(a < b) 为 False
# >= 	检查左操作数的值是否大于或等于右操作数的值，如果是，则条件成立。 	如a=3,b=3，则(a >= b) 为 True
# <= 	检查左操作数的值是否小于或等于右操作数的值，如果是，则条件成立。

a = 101
b = 101
# ==
# if a == b:
#     print("a等于b")

# !=
# if a != b:
#     print("a不等于b")

# >
# if a > b:
#     print("a大于b")

# >=
# if a >= b:
#     print("a大于等于b")

